{
  "name": "Martim Tiburcio",
  "photo": "https://media.licdn.com/dms/image/D4D03AQFq8qYmeV60dg/profile-displayphoto-shrink_800_800/0/1711839831764?e=1717027200&v=beta&t=abZTcEnrYyTfZ1wyDpyxa0nZDR4xsKQc5UqFFhswpS0",
  "job": "Salesperson at Interlux Electrical Materials",
  "location": "Nova Iguaçu - RJ",
  "linkedin": "tiburciomartim",
  "linkLinkedin": "https://www.linkedin.com/in/tiburciomartim/",
  "github": "tiburcioMartim",
  "linkGithub": "https://github.com/tiburcioMartim",
  "phone": "(21) 98886-0136",
  "email": "tiburciomartim@gmail.com",
  "bio": [
    {
      "title": "Hello, I'm Martim Tiburcio",
      "content": "Hello, my name is Martim Tiburcio and I will share a little bit of my story. I have always had a great interest in computers and the digital world, but due to a series of circumstances, I was not able to fully dedicate myself to studies. I had to deal with the responsibility of being a very young father and the need to work hard to support my family.<br><br>Throughout my professional journey, I have accumulated several significant experiences. I started my career in the Brazilian Navy, where I worked for 2 years as responsible for the vessels. Later, I worked in the public transportation of Tinguá as a fare collector, demonstrating my ability to adapt to new challenges.<br><br>Then, I joined Lojas Americanas S.A, initially as a merchandise separator and later, I was promoted to night checker. In addition, I worked as a food delivery driver on platforms such as iFood, Uber Eats, and Rappi, further expanding my professional experience.<br><br>I dedicated two years as a mechanic's assistant, which provided me with valuable skills to take care of my own vehicle in the future. I also had the opportunity to work for a year in an automotive parts industry, further enriching my professional repertoire.<br><br>Currently, I am at Interlux Electrical Materials, where I have been significantly contributing to the company's growth since March 2023. At the same time, I am investing in a career transition, pursuing a Bachelor's degree in Computer Science at Faculdade Descomplica and taking additional courses to enrich my portfolio.<br><br>I am extremely excited and committed to reaching new horizons in my career. My determination and passion for learning drive me to seek significant achievements in the field of technology. I am grateful for the opportunity to share a little about who I am, where I am, and where I am determined to go."
    }
  ],
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/html.svg"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/css.svg"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/js.svg"
      },
      {
        "name": "Illustrator",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/ai.svg"
      },
      {
        "name": "Photoshop",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/psd.svg"
      }
    ],
    "softSkills": [
      "Communication",
      "Commitment to results",
      "Ease of practical tasks",
      "Organization",
      "Team work"
    ]
  },
  "languages": [
    "Portuguese [BR]",
    "Basic English"
  ],
  "education": [
    {
      "name": "Graduating in Computer Science - Descomplica",
      "href": "https://descomplica.com.br/faculdade/tecnologia/ciencia-da-computacao/",
      "date": "January 2024 · Termination (2028)",
      "content": "I am currently studying Computer Science and this experience has been incredibly enriching. I have improved my skills in programming, problem solving and data analysis, as well as having the opportunity to work on challenging and innovative projects. Interaction with teachers and classmates has also contributed significantly to my academic and personal growth. I'm excited to explore the different areas of expertise that computing offers and to continue learning and evolving throughout the course."
    }
  ],
  "portfolio": [
    {
      "name": "Academic - Pokedex",
      "urlGithub": "https://github.com/tiburcioMartim/academic-DIO-Pokedex-Training-JavaScript-Developer",
      "urlProject": "https://tiburciomartim.github.io/academic-DIO-Pokedex-Training-JavaScript-Developer/",
      "github": true,
      "content": "In this project, I made a request to the Poke API, which significantly contributed to my learning in Promises. This experience provided the opportunity to deepen my knowledge in web development and allowed me to explore the integration of third-party APIs into applications. Furthermore, the project was developed in partnership with Digital Innovation One, under the guidance of professor Renan Johannsen, which added even more value to my learning journey. I'm excited to apply these skills to future projects and continue expanding my knowledge in the area of ​​software development."
    },
    {
      "name": "Academic - Calculator",
      "urlGithub": "https://github.com/tiburcioMartim/academic-DIO-PrototipeOfCalculator",
      "urlProject": "https://tiburciomartim.github.io/academic-DIO-PrototipeOfCalculator/",
      "github": true,
      "content": "This calculator was developed using HTML, CSS and JavaScript to implement the software logic. The experience of building this project gave me a deeper understanding of the integration between these technologies and how they work together to create a functional application. Furthermore, I had the opportunity to develop the project in collaboration with Digital Innovation One, which further enriched my learning journey. I look forward to applying these skills to future projects and continuing to improve my web development knowledge."
    },
    {
      "name": "Academic - Quiz",
      "urlGithub": "https://github.com/tiburcioMartim/academico-NLW-Expert-trilha-de-HTML-CSS-e-Javascript-da-Rocketset.",
      "urlProject": "https://tiburciomartim.github.io/academico-NLW-Expert-trilha-de-HTML-CSS-e-Javascript-da-Rocketset./",
      "github": true,
      "content": "During RocketSeat's NLW event, I had the opportunity to participate in the development of a quiz that significantly expanded my understanding of using lists. The experience of collaborating on this project under the guidance of Professor Mayke Brito was extremely enriching, providing valuable insights into the manipulation and effective use of lists in web applications. I'm excited to apply this knowledge to future projects and continue to deepen my understanding of software development."
    }
  ],
  "professionalExperience": [
    {
      "office": "Seller",
      "name": "Interlux Electrical Materials · Full-time",
      "period": "Mar 2023 · Present",
      "description": "I am currently employed at this company and am genuinely passionate about everything I do to contribute to its growth. However, recently I have been dedicating my time to a career transition. I am studying Computer Science, as I have passion and ease in learning in this market area."
    }
  ]
}