{
  "name": "Martim Tiburcio",
  "photo": "https://media.licdn.com/dms/image/D4D03AQFq8qYmeV60dg/profile-displayphoto-shrink_800_800/0/1711839831764?e=1717027200&v=beta&t=abZTcEnrYyTfZ1wyDpyxa0nZDR4xsKQc5UqFFhswpS0",
  "job": "Salesperson at Interlux Electrical Materials",
  "location": "Nova Iguaçu - RJ",
  "linkedin": "tiburciomartim",
  "linkLinkedin": "https://www.linkedin.com/in/tiburciomartim/",
  "github": "tiburcioMartim",
  "linkGithub": "https://github.com/tiburcioMartim",
  "phone": "(21) 98886-0136",
  "email": "tiburciomartim@gmail.com",
  "bio": [
    {
      "title": "Hello, I'm Martim Tiburcio",
      "content": "Olá, meu nome é Martim Tiburcio e vou compartilhar um pouco da minha história. Sempre tive grande interesse por computadores e pelo mundo digital, mas devido a uma série de circunstâncias, não pude me dedicar totalmente aos estudos. Tive que lidar com a responsabilidade de ser um pai muito jovem e a necessidade de trabalhar duro para sustentar minha família.<br><br>Ao longo da minha jornada profissional, acumulei diversas experiências significativas. Iniciei minha carreira na Marinha do Brasil, onde atuei por 2 anos como responsável pelas embarcações. Posteriormente, trabalhei no transporte público de Tinguá como cobrador de tarifas, demonstrando minha capacidade de me adaptar a novos desafios.<br><br>Em seguida, ingressei nas Lojas Americanas S.A, inicialmente como separador de mercadorias e, posteriormente, fui promovido a conferente noturno. Além disso, atuei como entregador de alimentos em plataformas como iFood, Uber Eats e Rappi, ampliando ainda mais minha experiência profissional.<br><br>Dediquei dois anos como auxiliar mecânico, o que me proporcionou habilidades valiosas para cuidar do meu próprio veículo no futuro. Também tive a oportunidade de trabalhar por um ano em uma indústria de peças automotivas, enriquecendo ainda mais meu repertório profissional.<br><br>Atualmente, estou na Interlux Materiais Elétricos, onde tenho contribuído significativamente para o crescimento da empresa desde março de 2023. Ao mesmo tempo, estou investindo em uma transição de carreira, cursando Bacharelado em Ciência da Computação na Faculdade Descomplica e realizando cursos adicionais para enriquecer meu portfólio.<br><br>Estou extremamente entusiasmado e comprometido em alcançar novos horizontes em minha carreira. Minha determinação e paixão pelo aprendizado me impulsionam a buscar conquistas significativas no campo da tecnologia. Agradeço a oportunidade de compartilhar um pouco sobre quem sou, onde estou e para onde estou determinado a ir."
    }
  ],
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/html.svg"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/css.svg"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/js.svg"
      },
      {
        "name": "Illustrator",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/ai.svg"
      },
      {
        "name": "Photoshop",
        "logo": "https://raw.githubusercontent.com/tiburcioMartim/myPortfolio/main/assets/img/icon/psd.svg"
      }
    ],
    "softSkills": [
      "Communication",
      "Commitment to results",
      "Ease of practical tasks",
      "Organization",
      "Team work"
    ]
  },
  "languages": [
    "Portuguese [BR]",
    "Basic English"
  ],
  "education": [
    {
      "name": "Graduating in Computer Science - Descomplica",
      "href": "https://descomplica.com.br/faculdade/tecnologia/ciencia-da-computacao/",
      "date": "January 2024 · Termination (2028)",
      "content": "I am currently studying Computer Science and this experience has been incredibly enriching. I have improved my skills in programming, problem solving and data analysis, as well as having the opportunity to work on challenging and innovative projects. Interaction with teachers and classmates has also contributed significantly to my academic and personal growth. I'm excited to explore the different areas of expertise that computing offers and to continue learning and evolving throughout the course."
    }
  ],
  "portfolio": [
    {
      "name": "Academic - Pokedex",
      "urlGithub": "https://github.com/tiburcioMartim/academic-DIO-Pokedex-Training-JavaScript-Developer",
      "urlProject": "https://tiburciomartim.github.io/academic-DIO-Pokedex-Training-JavaScript-Developer/",
      "github": true,
      "content": "In this project, I made a request to the Poke API, which significantly contributed to my learning in Promises. This experience provided the opportunity to deepen my knowledge in web development and allowed me to explore the integration of third-party APIs into applications. Furthermore, the project was developed in partnership with Digital Innovation One, under the guidance of professor Renan Johannsen, which added even more value to my learning journey. I'm excited to apply these skills to future projects and continue expanding my knowledge in the area of ​​software development."
    },
    {
      "name": "Academic - Calculator",
      "urlGithub": "https://github.com/tiburcioMartim/academic-DIO-PrototipeOfCalculator",
      "urlProject": "https://tiburciomartim.github.io/academic-DIO-PrototipeOfCalculator/",
      "github": true,
      "content": "This calculator was developed using HTML, CSS and JavaScript to implement the software logic. The experience of building this project gave me a deeper understanding of the integration between these technologies and how they work together to create a functional application. Furthermore, I had the opportunity to develop the project in collaboration with Digital Innovation One, which further enriched my learning journey. I look forward to applying these skills to future projects and continuing to improve my web development knowledge."
    },
    {
      "name": "Academic - Quiz",
      "urlGithub": "https://github.com/tiburcioMartim/academico-NLW-Expert-trilha-de-HTML-CSS-e-Javascript-da-Rocketset.",
      "urlProject": "https://tiburciomartim.github.io/academico-NLW-Expert-trilha-de-HTML-CSS-e-Javascript-da-Rocketset./",
      "github": true,
      "content": "During RocketSeat's NLW event, I had the opportunity to participate in the development of a quiz that significantly expanded my understanding of using lists. The experience of collaborating on this project under the guidance of Professor Mayke Brito was extremely enriching, providing valuable insights into the manipulation and effective use of lists in web applications. I'm excited to apply this knowledge to future projects and continue to deepen my understanding of software development."
    }
  ],
  "professionalExperience": [
    {
      "name": "Arquiteto de software / S3 BANK",
      "period": "2022 - até o momento",
      "description": "É um prazer trabalhar ao lado de tantos profissionais excepcionais e construir tantas inovações de mercado."
    },
    {
      "name": "Software Engineering Lead / DIO",
      "period": "2021 - 2022",
      "description": "Foi um grande prazer fazer parte deste time fantástico e poder contribuir com a transformação de tantas vidas."
    },
    {
      "name": "CEO / Brain Machine",
      "period": "2016 - 2021",
      "description": "Anos incríveis ao lado de pessoas maravilhosas ajudando muitas empresas por todo o mundo."
    }
  ]
}